<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"35fc95b085c78f0f1cb938878d7fb754cd589cb728d665105214204a9eaec893","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #659 at https://github.com/cal-itp/data-infra/actions/runs/17842188085","plan_out_hash":"f3cbea6901940734e43dd99e28a6710c6e213f337e6b442deb85b0d77e29a4ca","plan_hash":"212e4e19abd6ece4652cbf8c4949e3e024c7816f2e269accf09e3f1febd0f3b7","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "15GYUA==" -> (known after apply)
!~      detect_md5hash      = "iHc2WfYdG8yglsBVYg0dMw==" -> "different hash"
!~      generation          = 1758223598281022 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "iHc2WfYdG8yglsBVYg0dMw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "dKAn6w==" -> (known after apply)
!~      detect_md5hash      = "FPMQ3JZ3WbLypkEDLXIKbw==" -> "different hash"
!~      generation          = 1751587167527126 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "FPMQ3JZ3WbLypkEDLXIKbw==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/payments_entity_mapping.csv"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "2yShtQ==" -> (known after apply)
!~      detect_md5hash      = "BKdiHn72p4k34cBd6r6rBQ==" -> "different hash"
!~      generation          = 1755275089716305 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/seeds/payments_entity_mapping.csv"
!~      md5hash             = "BKdiHn72p4k34cBd6r6rBQ==" -> (known after apply)
        name                = "data/warehouse/seeds/payments_entity_mapping.csv"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "e3mBAQ==" -> (known after apply)
!~      detect_md5hash      = "YvGRuhGfnVCZAmAaGuD8pQ==" -> "different hash"
!~      generation          = 1758223599986022 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "YvGRuhGfnVCZAmAaGuD8pQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #659](https://github.com/cal-itp/data-infra/actions/runs/17842188085)